STMicroelectronics/STM32CubeWB/Projects/P-NUCLEO-WB55.Nucleo/Applications/Zigbee/Zigbee_OTA_Client_Router/STM32_WPAN/App/app_zigbee.c
static struct zigbee_app_info zigbee_app_info;

static uint8_t TS_ID_LED;

/* NVM variables */
/* cache in uninit RAM to store/retrieve persistent data */
union cache
{
  uint8_t  U8_data[ST_PERSIST_MAX_ALLOC_SZ];     // in bytes 
  uint32_t U32_data[ST_PERSIST_MAX_ALLOC_SZ/4U]; // in U32 words
};
__attribute__ ((section(".noinit"))) union cache cache_persistent_data;

__attribute__ ((section(".noinit"))) union cache cache_diag_reference;

/* timer to delay reading attribute back from persistence */
static uint8_t TS_ID1; 
static uint8_t TS_ID2; 

/* Functions Definition ------------------------------------------------------*/

/**
 * @brief  OTA client Discover callback
 * @param  clusterPtr: ZCL Cluster pointer
 * @param  arg: Passed argument
 * @retval ZCL status code
 */
static enum ZclStatusCodeT APP_ZIGBEE_OTA_Client_DiscoverComplete_cb(struct ZbZclClusterT *clusterPtr, void *arg){
  enum ZclStatusCodeT status = ZCL_STATUS_SUCCESS;
  uint64_t requested_server_ext = 0;
  
  /* The OTA server extended address in stored in ZCL_OTA_ATTR_UPGRADE_SERVER_ID attribute */
  requested_server_ext = ZbZclAttrIntegerRead(zigbee_app_info.ota_client, ZCL_OTA_ATTR_UPGRADE_SERVER_ID, NULL, &status);
  if(status != ZCL_STATUS_SUCCESS){
    APP_DBG("ZbZclAttrIntegerRead failed.\n");
  }
  
  APP_DBG("OTA Server located with EUI64 0x%016" PRIx64 ".", requested_server_ext);
  UTIL_SEQ_SetEvt(EVENT_ZIGBEE_OTA_SERVER_FOUND);
  
  return status;
}

/**
 * @brief  OTA client Image Notify callback
 * @param  clusterPtr: ZCL Cluster pointer
 * @param  payload_type: Payload type
 * @param  jitter: Upgrade jitter given to the client
 * @param  image_definition: Image query definition pointer
 * @param  data_ind: APS layer packet info
 * @param  zcl_header: ZCL header
 * @retval ZCL status code
 */
static enum ZclStatusCodeT APP_ZIGBEE_OTA_Client_ImageNotify_cb(struct ZbZclClusterT *clusterPtr, uint8_t payload_type, 
                                                                uint8_t jitter, struct ZbZclOtaImageDefinition *image_definition,
                                                                struct ZbApsdeDataIndT *data_ind, struct ZbZclHeaderT *zcl_header){
  bool checkFileType = false, checkFileVersion = false;
  int pos = -1;
  
  APP_DBG("[OTA] Image Notify request received.");
  
  /* Print message info according to Image Notify request payload type */
  switch(payload_type){
    case ZCL_OTA_NOTIFY_TYPE_FILE_VERSION:
      APP_DBG("[OTA] Available upgrade jitter: %d.", jitter);
      APP_DBG("[OTA] Available upgrade manufacturer code: %d.", image_definition->manufacturer_code);
      APP_DBG("[OTA] Available upgrade image type: 0x%04x.", image_definition->image_type);
      APP_DBG("[OTA] Available upgrade (new) file version: 0x%08x.", image_definition->file_version);
      
      if(image_definition->manufacturer_code != ST_ZIGBEE_MANUFACTURER_CODE){
        APP_DBG("[OTA] Unauthorized OTA upgrade manufacturer.\n");
        return ZCL_STATUS_FAILURE;
      }
      
      /* check image type and file version */
      checkFileType = true;
      checkFileVersion = true;
      break;
      
    default:
      APP_DBG("[OTA] Not supported payload type.\n");
      return ZCL_STATUS_FAILURE;
  }
  
  /* Check file type */
  if(checkFileType){
    pos = APP_ZIGBEE_FindImageType(image_definition->image_type);
    if(pos<0){
      /* Unknown file type */
      APP_DBG("[OTA] Unknown file type type.\n");
      return ZCL_STATUS_FAILURE;
    }
  }
  
  /* Check file version */
  if(checkFileVersion){
    if(OTA_currentFileVersionTab[pos].fileVersion == image_definition->file_version){
      APP_DBG("[OTA] Already up-to-date for this file type.\n");
      return ZCL_STATUS_FAILURE;
    }
  }
  
  APP_DBG("[OTA] Everything is OK, can process to the OTA upgrade.\n");

  /* Requesting an upgrade according to server image type 
   * => re-send an Query Next Image request  back to the upgrade server */
  OTA_client_info.image_type = image_definition->image_type;
  OTA_client_info.current_file_version = OTA_currentFileVersionTab[pos].fileVersion;
  UTIL_SEQ_SetTask(1U << CFG_TASK_ZIGBEE_OTA_REQUEST_UPGRADE, CFG_SCH_PRIO_0);
  
  return ZCL_STATUS_SUCCESS;
}

/**
 * @brief  OTA client Query Next Image callback
 * @param  clusterPtr: ZCL Cluster pointer
 * @param  status: ZCL status code returned by the server for the requested image
 * @param  image_definition: Image query definition pointer
 * @param  image_size: OTA file format image total size
 * @param  arg: Passed arg
 * @retval ZCL status code
 */
static void APP_ZIGBEE_OTA_Client_QueryNextImage_cb(struct ZbZclClusterT *clusterPtr, enum ZclStatusCodeT status, 
                                                    struct ZbZclOtaImageDefinition *image_definition, uint32_t image_size, void *arg){
  struct Zigbee_OTA_client_info* client_info = (struct Zigbee_OTA_client_info*) arg;
  
  APP_DBG("[OTA] Client Query Next Image request response received.");
  if(status != ZCL_STATUS_SUCCESS){
    APP_DBG("[OTA] A such image is not available.\n");
    return;
  } else {
    APP_DBG("[OTA] A such image is available.");
  }
  
  switch(image_definition->image_type){
    case fileType_COPRO_WIRELESS:
      client_info->ctx.base_address = FUOTA_COPRO_FW_BINARY_ADDRESS;
      client_info->ctx.magic_keyword = FUOTA_MAGIC_KEYWORD_COPRO_WIRELESS;
      break;
      
    case fileType_APP:
      client_info->ctx.base_address = FUOTA_APP_FW_BINARY_ADDRESS;
      client_info->ctx.magic_keyword = FUOTA_MAGIC_KEYWORD_APP;
      break;
      
    default:
      APP_DBG("[OTA] Error, unknown image type.\n");
      return;
  }
  client_info->requested_image_size = image_size;
  
  if(APP_ZIGBEE_CheckDeviceCapabilities() != APP_ZIGBEE_OK){
    APP_DBG("[OTA] Not enough space. No download.\n");
    return;
  }

  APP_DBG("[OTA] For image type 0x%04x, %d byte(s) will be downloaded.", image_definition->image_type, image_size);
  UTIL_SEQ_SetTask(1U << CFG_TASK_ZIGBEE_OTA_START_DOWNLOAD, CFG_SCH_PRIO_0);
  APP_DBG("[OTA] Starting download.\n");
}

/**
 * @brief  OTA client Write Image callback
 * @param  clusterPtr: ZCL Cluster pointer
 * @param  header: ZCL OTA file format image header
 * @param  length: received chunk length
 * @param  data: received chunk payload
 * @param  arg: Passed arg
 * @retval ZCL status code
 */
static enum ZclStatusCodeT APP_ZIGBEE_OTA_Client_WriteImage_cb(struct ZbZclClusterT *clusterPtr, struct ZbZclOtaHeader *header,
                                                               uint8_t length, uint8_t *data, void *arg){
  static uint32_t current_offset = 0;
    
  struct Zigbee_OTA_client_info* client_info = (struct Zigbee_OTA_client_info*) arg;
  enum ZclStatusCodeT status = ZCL_STATUS_SUCCESS;
  uint8_t size = 0;
  uint8_t remaining_size = 0;
  
  current_offset += length;
  size = length;
  
  if(client_info->write_info.firmware_buffer_current_offset + size > RAM_FIRMWARE_BUFFER_SIZE){
    size = RAM_FIRMWARE_BUFFER_SIZE - client_info->write_info.firmware_buffer_current_offset;
    remaining_size = length - size;
    client_info->write_info.buffer_full = true;
  } else if(client_info->write_info.firmware_buffer_current_offset+size == RAM_FIRMWARE_BUFFER_SIZE){
    client_info->write_info.buffer_full = true;
  }
  memcpy((client_info->write_info.firmware_buffer+client_info->write_info.firmware_buffer_current_offset), data, size);
  client_info->write_info.firmware_buffer_current_offset += size;
  
  if(client_info->write_info.buffer_full){
    /* Display Transfer Progress */
    APP_DBG("[OTA] FUOTA Transfer (current_offset = %d)",current_offset);
  
    /* Write to Flash Memory */
    if(APP_ZIGBEE_OTA_Client_WriteFirmwareData(client_info) != APP_ZIGBEE_OK){
      return ZCL_STATUS_FAILURE;
    }
    
    memset(client_info->write_info.firmware_buffer, 0, RAM_FIRMWARE_BUFFER_SIZE);
    memcpy(client_info->write_info.firmware_buffer, data+size, remaining_size);
    client_info->write_info.firmware_buffer_current_offset = remaining_size;
    client_info->write_info.buffer_full = false;
  }
  
