STMicroelectronics/STM32CubeWB/Projects/P-NUCLEO-WB55.Nucleo/Applications/Zigbee/Zigbee_OTA_Client_Router/STM32_WPAN/App/app_zigbee.c
  return status;
}

/**
 * @brief  OTA client Image Validate callback
 * @param  clusterPtr: ZCL Cluster pointer
 * @param  header: ZCL OTA file format image header
 * @param  arg: Passed arg
 * @retval ZCL status code
 */
static enum ZclStatusCodeT APP_ZIGBEE_OTA_Client_ImageValidate_cb(struct ZbZclClusterT *clusterPtr, struct ZbZclOtaHeader *header, void *arg){
  struct Zigbee_OTA_client_info* client_info = (struct Zigbee_OTA_client_info*) arg;
  enum ZclStatusCodeT status = ZCL_STATUS_SUCCESS;
  uint64_t last_double_word = 0;
  double l_transfer_throughput = 0;
  
  /* Download finished => stop Toggling of the LED */
  HW_TS_Stop(TS_ID_LED);
  BSP_LED_Off(LED_GREEN);
  APP_DBG("LED_GREEN OFF");
  
  /* Write the last RAM buffer to Flash */
  if(client_info->write_info.firmware_buffer_current_offset != 0){
    /* Write to Flash Memory */
    APP_ZIGBEE_OTA_Client_WriteFirmwareData(client_info);
    client_info->write_info.firmware_buffer_current_offset = 0;
  }
  
  APP_DBG("**************************************************************\n");
  APP_DBG("[OTA] Validating the image.");
  
  /* Finding the magic number */
  
  /* Last double word in Flash
   * => the magic if the firmware is valid
   */
  client_info->write_info.flash_current_offset -= 8;
  memcpy(&last_double_word, (void const*)(client_info->ctx.base_address + client_info->write_info.flash_current_offset), 8);
  if(((last_double_word & 0x00000000FFFFFFFF) != client_info->ctx.magic_keyword)
     && (((last_double_word & 0xFFFFFFFF00000000) >> 32)!= client_info->ctx.magic_keyword)){
    APP_DBG("[OTA] Wrong magic keyword: invalid firmware.\n");
    status = ZCL_STATUS_INVALID_IMAGE;
    return status;
  }
  
  APP_DBG("[OTA] The downloaded firmware is valid.\n");
  client_info->download_time = (HAL_GetTick()- client_info->download_time)/1000;
  l_transfer_throughput = (((double)client_info->requested_image_size/client_info->download_time) / 1000) * 8;
  
  APP_DBG("**************************************************************");
  APP_DBG(" FUOTA : END OF TRANSFER COMPLETED");
    
  if(client_info->image_type == IMAGE_TYPE_FW_COPRO_WIRELESS){
    APP_DBG("  - M0 wireless coprocessor firmware.");
  } else {
    APP_DBG("  - M4 application firmware.");
  }
  
  APP_DBG("  - %d bytes downloaded in %d seconds.",  client_info->requested_image_size, client_info->download_time);
  APP_DBG("  - Average throughput = %.2f kbit/s.", l_transfer_throughput);
  APP_DBG("**************************************************************");
  
  BSP_LED_On(LED_GREEN);
  APP_DBG("LED_GREEN ON");
  
  return status;
}

/**
 * @brief  OTA client Reboot callback
 * @param  clusterPtr: ZCL Cluster pointer
 * @param  arg: Passed arg
 * @retval None
 */
static void APP_ZIGBEE_OTA_Client_Reboot_cb(struct ZbZclClusterT *clusterPtr, void *arg){
  UNUSED(arg);
  
  APP_DBG("**************************************************************");
  APP_DBG("[OTA] Rebooting.");
  
  APP_DBG("LED_BLUE OFF");
  BSP_LED_Off(LED_BLUE);
  APP_DBG("LED_GREEN OFF");
  BSP_LED_Off(LED_GREEN);
  APP_DBG("**************************************************************\n");
  
  HAL_Delay(100);
  UTIL_SEQ_SetTask(1U << (uint32_t)CFG_TASK_FUOTA_RESET, CFG_SCH_PRIO_0);
}

/**
 * @brief  OTA client Abort callback
 * @param  clusterPtr: ZCL Cluster pointer
 * @param  commandId: ZCL OTA command ID associated to the block transfer abortion
 * @param  arg: Passed arg
 * @retval ZCL status code
 */
static enum ZclStatusCodeT APP_ZIGBEE_OTA_Client_AbortDownload_cb(struct ZbZclClusterT *clusterPtr, enum ZbZclOtaCommandId commandId, void *arg){
  UNUSED(arg);
  
  APP_DBG("[OTA] Aborting download.");
  HW_TS_Stop(TS_ID_LED);
  BSP_LED_Off(LED_GREEN);
  BSP_LED_On(LED_RED);
  
  return ZCL_STATUS_ABORT;
}

/**
 * @brief  OTA client request upgrade
 * @param  None
 * @retval None
 */
static inline void APP_ZIGBEE_OTA_Client_Request_Upgrade(void){
  enum ZclStatusCodeT status;
  struct ZbZclOtaImageDefinition image_definition;
  
  APP_DBG("[OTA] Requesting an update.");
  APP_DBG("[OTA] Image type: 0x%04x.", OTA_client_info.image_type);
  APP_DBG("[OTA] Current file version: 0x%08x.\n", OTA_client_info.current_file_version);
  
  /* Image definition configuration */
  memset(&image_definition, 0, sizeof(image_definition));
  image_definition.manufacturer_code = ST_ZIGBEE_MANUFACTURER_CODE;
  image_definition.image_type = OTA_client_info.image_type;
  image_definition.file_version = OTA_client_info.current_file_version;
  
  /* Sending Discovery request to server */
  APP_DBG("[OTA] Sending Query Next Image request.");
  /* HW version is provided as additional info in Query Next Image request */
  status = ZbZclOtaClientQueryNextImageReq(zigbee_app_info.ota_client, &image_definition, 
                                           ZCL_OTA_QUERY_FIELD_CONTROL_HW_VERSION, CURRENT_HARDWARE_VERSION);
  if(status != ZCL_STATUS_SUCCESS){
    APP_DBG("ZbZclOtaClientDiscover failed.\n");
  }
}

/**
 * @brief  OTA client start download
 * @param  None
 * @retval None
 */
static inline void APP_ZIGBEE_OTA_Client_StartDownload(void){
  HW_TS_Start(TS_ID_LED, (uint32_t)LED_TOGGLE_TIMING);
  OTA_client_info.download_time = HAL_GetTick();
  ZbZclOtaClientImageTransferStart(zigbee_app_info.ota_client);
}

/**
 * @brief  OTA Server find image type helper
 * @param  fileType: requested file type
 * @retval index value
 */
static inline int APP_ZIGBEE_FindImageType(unsigned int fileType)
{
    for(unsigned int i=0; i<(sizeof(OTA_currentFileVersionTab)/sizeof(*OTA_currentFileVersionTab)); i++)
    {
        if(OTA_currentFileVersionTab[i].fileType == fileType){ return i; }
    }
    return -1;
}

/**
 * @brief  OTA client writing firmware data from internal RAM cache to flash
 * @param  client_info: OTA client internal structure
 * @retval Application status code
 */
static inline APP_ZIGBEE_StatusTypeDef APP_ZIGBEE_OTA_Client_WriteFirmwareData(struct Zigbee_OTA_client_info* client_info){
  uint64_t l_read64 = 0;
  
  /* Write to Flash Memory */
  for(unsigned int flash_index = 0; flash_index < client_info->write_info.firmware_buffer_current_offset; flash_index+=8){
    while( LL_HSEM_1StepLock( HSEM, CFG_HW_FLASH_SEMID ) );
    HAL_FLASH_Unlock();
    while(LL_FLASH_IsActiveFlag_OperationSuspended());

    memcpy(&l_read64, &(client_info->write_info.firmware_buffer[flash_index]), 8);
    if (HAL_FLASH_Program(FLASH_TYPEPROGRAM_DOUBLEWORD,
        client_info->ctx.base_address + client_info->write_info.flash_current_offset,
        l_read64) == HAL_OK)
    {
      /* Read back value for verification */
      l_read64 = 0;
      l_read64 = *(uint64_t*)(client_info->ctx.base_address + client_info->write_info.flash_current_offset);
      if(l_read64 != (*(uint64_t*)(client_info->write_info.firmware_buffer+flash_index)))
      {
        APP_DBG("FLASH: Comparison failed l_read64 = 0x%jx / ram_array = 0x%jx", 
                l_read64, client_info->write_info.firmware_buffer[flash_index]);
        return APP_ZIGBEE_ERROR;
      }
    }
    else
    {
      APP_DBG("HAL_FLASH_Program FAILED at flash_index = %d", flash_index);
      return APP_ZIGBEE_ERROR;
    }

    HAL_FLASH_Lock();
    LL_HSEM_ReleaseLock( HSEM, CFG_HW_FLASH_SEMID, 0 );
        
    client_info->write_info.flash_current_offset += 8;
  }
  
